---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
source: html/2ee7b5dc-0179-ea05-b8f7-84777b4dd2f0.htm
---
# StructuralSectionGeneralW Members

Creates a new instance of Angle shape.